Repository: eduNEXT/platform-plugin-ontask
Catalog: platform_plugin_ontask/conf/locale/*/LC_MESSAGES/django.po
Languages: eo, es_es

source: The course key is not valid.
eo: Thé çöürsé kéý ïs nöt välïd. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢#
es_es: El course key no es válido.

source: The course does not exist.
eo: Thé çöürsé döés nöt éxïst. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕ#
es_es: El curso no existe.

source: The OnTask API Auth Token is not set for this course. Please set it in the Advanced Settings of the course.
eo: Thé ÖnTäsk ÀPÌ Àüth Tökén ïs nöt sét för thïs çöürsé. Pléäsé sét ït ïn thé Àdvänçéd Séttïngs öf thé çöürsé. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт#
es_es: El token de autenticación de la API de OnTask no está configurado para este curso. Por favor, configúrelo en la Configuración Avanzada del curso.

source: The OnTask Workflow ID is not set for this course. Please set it in the Advanced Settings of the course.
eo: Thé ÖnTäsk Wörkflöw ÌD ïs nöt sét för thïs çöürsé. Pléäsé sét ït ïn thé Àdvänçéd Séttïngs öf thé çöürsé. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт α#
es_es: El ID del workflow de OnTask no está configurado para este curso. Por favor, configúrelo en la Configuración Avanzada del curso.

source: Load the data from the course into OnTask. This will create a new table in OnTask with the data summary configured. The default data summary is the completion data of the course. Every time you load the data, the table will be recreated. To view the OnTask table you need login to OnTask and go to Table > View data.
eo: Löäd thé dätä fröm thé çöürsé ïntö ÖnTäsk. Thïs wïll çréäté ä néw täßlé ïn ÖnTäsk wïth thé dätä sümmärý çönfïgüréd. Thé défäült dätä sümmärý ïs thé çömplétïön dätä öf thé çöürsé. Évérý tïmé ýöü löäd thé dätä, thé täßlé wïll ßé réçréätéd. Tö vïéw thé ÖnTäsk täßlé ýöü nééd lögïn tö ÖnTäsk änd gö tö Täßlé > Vïéw dätä. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α∂ιριѕι¢ιηg єłιт, ѕє∂ ∂σ єιυѕмσ∂ тємρσя ιη¢ι∂ι∂υηт υт łαвσяє єт ∂σłσяє мαgηα αłιqυα. υт єηιм α∂ #

source: Load data
eo: Löäd dätä Ⱡ'σяєм ιρѕυм ∂σł#
es_es: Cargar datos

source: Loading dataframe... Please wait a few minutes.
eo: Löädïng dätäfrämé... Pléäsé wäït ä féw mïnütés. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α#
es_es: Cargando dataframe... Por favor, espera unos minutos.

source: Welcome to OnTask Open edX Connection
eo: Wélçömé tö ÖnTäsk Öpén édX Çönnéçtïön Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυ#
es_es: Bienvenido a la Conexión de OnTask con Open edX

source: Create workflow
eo: Çréäté wörkflöw Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт α#
es_es: Crear workflow

source: An error occurred while creating the workflow. Ensure the workflow for this course does not already exist, and that the OnTask API Auth token is correct.
eo: Àn érrör öççürréd whïlé çréätïng thé wörkflöw. Énsüré thé wörkflöw för thïs çöürsé döés nöt älréädý éxïst, änd thät thé ÖnTäsk ÀPÌ Àüth tökén ïs çörréçt. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α∂ιριѕι¢ιηg єłιт, ѕє∂ ∂σ єιυѕмσ∂ тємρσя ιη¢ι∂ι∂υηт υт łαвσяє єт ∂σłσяє мαgηα αłιqυα. υт єηιм α∂ мιηιм νєηιαм, qυιѕ ησѕтяυ∂ єχєя¢ιтαтιση υłłαм¢σ łαвσяιѕ ηιѕι υт αłιqυιρ єχ єα ¢σммσ∂σ ¢σηѕєqυαт. ∂υιѕ αυтє ιяυяє ∂σłσя ιη яєρяєнєη∂єяιт ιη νσłυρтαтє νєłιт єѕѕє ¢ιłłυм ∂σłσяє єυ ƒυgιαт ηυłłα ραяιαтυя. єχ¢єρтєυя ѕιηт σ¢¢αє¢αт ¢υρι∂αтαт ηση ρяσι∂єηт, ѕυηт ιη ¢υłρα qυι σƒƒι¢ια ∂єѕєяυηт мσłłι#
es_es: Ocurrió un error al crear el workflow. Asegúrese que el workflow para este curso no exista aún y que el token de autenticación de la API de OnTask sea correcto.

source: There is no workflow ID associated with the course.
eo: Théré ïs nö wörkflöw ÌD ässöçïätéd wïth thé çöürsé. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α#
es_es: No hay un ID de workflow asociado con el curso.

source: Create a new one by pressing the 'Create Workflow' button. Optionally, if you already have one, configure it from Studio > Advanced Settings > Other Course Settings. You should add the property 'ONTASK_WORKFLOW_ID' with the OnTask workflow ID.
eo: Çréäté ä néw öné ßý préssïng thé 'Çréäté Wörkflöw' ßüttön. Öptïönällý, ïf ýöü älréädý hävé öné, çönfïgüré ït fröm Stüdïö > Àdvänçéd Séttïngs > Öthér Çöürsé Séttïngs. Ýöü shöüld ädd thé pröpértý 'ÖNTÀSK_WÖRKFLÖW_ÌD' wïth thé ÖnTäsk wörkflöw ÌD. Ⱡ'σяєм ιρѕυм ∂σłσя ѕιт αмєт, ¢σηѕє¢тєтυя α∂ιριѕι¢ιηg єłιт, ѕє∂ ∂σ єιυѕмσ∂ тємρσя ιη¢ι∂ι∂υηт υт łαвσяє єт ∂σłσяє мαgηα αłιqυα. υт єηιм α∂ мιηιм νєηιαм, qυιѕ ησѕтяυ∂ єχєя¢ιтαтιση υłłαм¢σ łαвσяιѕ ηιѕι υт αłιqυιρ єχ єα ¢σммσ∂σ ¢σηѕєqυαт. ∂υιѕ αυтє ιяυяє ∂σłσя ιη яєρяєнєη∂єяιт ιη νσłυρтαтє ν#
es_es: Crea uno nuevo presionando el botón 'Crear Workflow'. Opcionalmente, si ya tienes uno, configúralo desde Studio > Configuración Avanzada > Other Course Settings. Debes agregar la propiedad 'ONTASK_WORKFLOW_ID' con el ID del workflow de OnTask.

source: Load the data from the course into OnTask. This will create a new table in OnTask with the data summary configured in the plugin settings. The default data summary is the completion data of the course. Every time you load the data, the table will be recreated. To view the OnTask table you need login to OnTask and go to Table > View data.
es_es: Carga los datos del curso en OnTask. Esto creará una nueva tabla en OnTask con el resumen de datos configurado en el plugin. El resumen de datos predeterminado se basa los datos de finalización del curso. Cada vez que cargues los datos, la tabla se recreará. Para ver la tabla de OnTask, debes iniciar sesión en OnTask e ir a Table > View data.
