Repository: eduNEXT/platform-plugin-ontask
Catalog: platform_plugin_ontask/conf/locale/rtl/LC_MESSAGES/django.po
Languages: rtl

source: The course key is not valid.
rtl: Ŧɥǝ ɔønɹsǝ ʞǝʎ ᴉs nøʇ ʌɐlᴉd.

source: The course does not exist.
rtl: Ŧɥǝ ɔønɹsǝ døǝs nøʇ ǝxᴉsʇ.

source: The OnTask API Auth Token is not set for this course. Please set it in the Advanced Settings of the course.
rtl: Ŧɥǝ ØnŦɐsʞ ȺⱣƗ Ⱥnʇɥ Ŧøʞǝn ᴉs nøʇ sǝʇ ɟøɹ ʇɥᴉs ɔønɹsǝ. Ᵽlǝɐsǝ sǝʇ ᴉʇ ᴉn ʇɥǝ Ⱥdʌɐnɔǝd Sǝʇʇᴉnƃs øɟ ʇɥǝ ɔønɹsǝ.

source: The OnTask Workflow ID is not set for this course. Please set it in the Advanced Settings of the course.
rtl: Ŧɥǝ ØnŦɐsʞ Wøɹʞɟløʍ ƗĐ ᴉs nøʇ sǝʇ ɟøɹ ʇɥᴉs ɔønɹsǝ. Ᵽlǝɐsǝ sǝʇ ᴉʇ ᴉn ʇɥǝ Ⱥdʌɐnɔǝd Sǝʇʇᴉnƃs øɟ ʇɥǝ ɔønɹsǝ.

source: Load the data from the course into OnTask. This will create a new table in OnTask with the data summary configured. The default data summary is the completion data of the course. Every time you load the data, the table will be recreated. To view the OnTask table you need login to OnTask and go to Table > View data.
rtl: Łøɐd ʇɥǝ dɐʇɐ ɟɹøɯ ʇɥǝ ɔønɹsǝ ᴉnʇø ØnŦɐsʞ. Ŧɥᴉs ʍᴉll ɔɹǝɐʇǝ ɐ nǝʍ ʇɐblǝ ᴉn ØnŦɐsʞ ʍᴉʇɥ ʇɥǝ dɐʇɐ snɯɯɐɹʎ ɔønɟᴉƃnɹǝd. Ŧɥǝ dǝɟɐnlʇ dɐʇɐ snɯɯɐɹʎ ᴉs ʇɥǝ ɔøɯdlǝʇᴉøn dɐʇɐ øɟ ʇɥǝ ɔønɹsǝ. Ɇʌǝɹʎ ʇᴉɯǝ ʎøn løɐd ʇɥǝ dɐʇɐ, ʇɥǝ ʇɐblǝ ʍᴉll bǝ ɹǝɔɹǝɐʇǝd. Ŧø ʌᴉǝʍ ʇɥǝ ØnŦɐsʞ ʇɐblǝ ʎøn nǝǝd løƃᴉn ʇø ØnŦɐsʞ ɐnd ƃø ʇø Ŧɐblǝ > Vᴉǝʍ dɐʇɐ.

source: Load data
rtl: Łøɐd dɐʇɐ

source: Loading dataframe... Please wait a few minutes.
rtl: Łøɐdᴉnƃ dɐʇɐɟɹɐɯǝ... Ᵽlǝɐsǝ ʍɐᴉʇ ɐ ɟǝʍ ɯᴉnnʇǝs.

source: Welcome to OnTask Open edX Connection
rtl: Wǝlɔøɯǝ ʇø ØnŦɐsʞ Ødǝn ǝdX Ȼønnǝɔʇᴉøn

source: Create workflow
rtl: Ȼɹǝɐʇǝ ʍøɹʞɟløʍ

source: An error occurred while creating the workflow. Ensure the workflow for this course does not already exist, and that the OnTask API Auth token is correct.
rtl: Ⱥn ǝɹɹøɹ øɔɔnɹɹǝd ʍɥᴉlǝ ɔɹǝɐʇᴉnƃ ʇɥǝ ʍøɹʞɟløʍ. Ɇnsnɹǝ ʇɥǝ ʍøɹʞɟløʍ ɟøɹ ʇɥᴉs ɔønɹsǝ døǝs nøʇ ɐlɹǝɐdʎ ǝxᴉsʇ, ɐnd ʇɥɐʇ ʇɥǝ ØnŦɐsʞ ȺⱣƗ Ⱥnʇɥ ʇøʞǝn ᴉs ɔøɹɹǝɔʇ.

source: There is no workflow ID associated with the course.
rtl: Ŧɥǝɹǝ ᴉs nø ʍøɹʞɟløʍ ƗĐ ɐssøɔᴉɐʇǝd ʍᴉʇɥ ʇɥǝ ɔønɹsǝ.

source: Create a new one by pressing the 'Create Workflow' button. Optionally, if you already have one, configure it from Studio > Advanced Settings > Other Course Settings. You should add the property 'ONTASK_WORKFLOW_ID' with the OnTask workflow ID.
rtl: Ȼɹǝɐʇǝ ɐ nǝʍ ønǝ bʎ dɹǝssᴉnƃ ʇɥǝ 'Ȼɹǝɐʇǝ Wøɹʞɟløʍ' bnʇʇøn. Ødʇᴉønɐllʎ, ᴉɟ ʎøn ɐlɹǝɐdʎ ɥɐʌǝ ønǝ, ɔønɟᴉƃnɹǝ ᴉʇ ɟɹøɯ Sʇndᴉø > Ⱥdʌɐnɔǝd Sǝʇʇᴉnƃs > Øʇɥǝɹ Ȼønɹsǝ Sǝʇʇᴉnƃs. Ɏøn sɥønld ɐdd ʇɥǝ dɹødǝɹʇʎ 'ØNŦȺSꝀ_WØɌꝀFŁØW_ƗĐ' ʍᴉʇɥ ʇɥǝ ØnŦɐsʞ ʍøɹʞɟløʍ ƗĐ.
